In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [4]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [5]:
# with this command we will see the name of the columns as index

ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [6]:
# FIRST METHOD

# let say that we want to change the name of columns "colors reported" and 
# "Shape Reported" - just to take off the space. 

# We will use the rename DataFrame method:

# In order to change the name we have to use the rename method and then 
# 'call' the columns and then we pass the columns argument into a dictionary using {}
# We need to mention the actual name in quotes and then separate with : and write the new name
# we can modify multiple names with separating by comma (,) and we need to add 
# the inplace=True argument, meaning I want this operation to occur inplace

ufo.rename(columns = {'colors Reported':'Colors_Reported', 
                      'Shape Reported':'Shape_reported'}, inplace=True)

In [7]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape_reported', 'State', 'Time'], dtype='object')

In [8]:
# SECOND METHOD 

# IF you want to change all the names:

# We can create a python list of strings: 

ufo_cols = ['city', 'colors reported', 'shape reported', 'state', 'time']

# this is my python list

In [9]:
# I will call the columns and overwrite with the new list:

ufo.columns = ufo_cols

In [10]:
ufo.head()

                   city colors reported shape reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [11]:
# Third method

# You can rename the columns while you are reading on the file: 

# ufo = pd.read_csv('http://bit.ly/uforeports') 

# the first step is to add the information names = cols (that is the info we created in step 2)

# and in this case we need to add the argument header=0 

ufo = pd.read_csv('http://bit.ly/uforeports', names=ufo_cols, header=0)

In [12]:
ufo.head()

                   city colors reported shape reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [13]:
# How to replace spaces with underscores?

ufo.columns

Index(['city', 'colors reported', 'shape reported', 'state', 'time'], dtype='object')

In [14]:
# here we take the ufo.columns and make the replacement with .str.replace

ufo.columns = ufo.columns.str.replace(' ','_')

In [15]:
ufo.columns

Index(['city', 'colors_reported', 'shape_reported', 'state', 'time'], dtype='object')